/**
 * Created by liuc on 2016/11/9.
 */
var data = [
    {
        pid: 1,
        h2: '家用电器',
        ul: [
            {
                pid: 2,
                h2: '电视',
                ul: [
                    {
                        pid: 3,
                        h2: '合资品牌',
                        ul: [
                            {pid: 4, h2: '合资1'},
                            {pid: 4, h2: '合资2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '国产品牌',
                        ul: [
                            {pid: 4, h2: '国产1'},
                            {pid: 4, h2: '国产2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '互联网品牌',
                        ul: [
                            {pid: 4, h2: '互联网1'},
                            {pid: 4, h2: '互联网2'}
                        ]
                    }
                ]
            }, {
                pid: 2,
                h2: '空调',
                ul: [
                    {
                        pid: 3,
                        h2: '壁挂式空调',
                        ul: [
                            {pid: 4, h2: '壁挂式1'},
                            {pid: 4, h2: '壁挂式2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '柜式空调',
                        ul: [
                            {pid: 4, h2: '柜式1'},
                            {pid: 4, h2: '柜式2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '中央空调',
                        ul: [
                            {pid: 4, h2: '中央1'},
                            {pid: 4, h2: '中央2'}
                        ]
                    }
                ]
            }, {
                pid: 2,
                h2: '洗衣机',
                ul: [
                    {
                        pid: 3,
                        h2: '滚轮洗衣机',
                        ul: [
                            {pid: 4, h2: '滚轮1'},
                            {pid: 4, h2: '滚轮2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '洗烘一体机',
                        ul: [
                            {pid: 4, h2: '洗烘1'},
                            {pid: 4, h2: '洗烘2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '波轮洗衣机',
                        ul: [
                            {pid: 4, h2: '波轮1'},
                            {pid: 4, h2: '波轮2'}
                        ]
                    }
                ]
            }
        ]
    }, {
        pid: 1,
        h2: '手机',
        ul: [
            {
                pid: 2,
                h2: '手机通讯',
                ul: [
                    {
                        pid: 3,
                        h2: '20天保价',
                        ul: [
                            {pid: 4, h2: '20天1'},
                            {pid: 4, h2: '20天2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '手机',
                        ul: [
                            {pid: 4, h2: '手机1'},
                            {pid: 4, h2: '手机2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '对讲机',
                        ul: [
                            {pid: 4, h2: '对讲机1'},
                            {pid: 4, h2: '对讲机2'}
                        ]
                    }
                ]
            }, {
                pid: 2,
                h2: '运营商',
                ul: [
                    {
                        pid: 3,
                        h2: '充话费/流量',
                        ul: [
                            {pid: 4, h2: '充话费1'},
                            {pid: 4, h2: '充话费2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '170选号',
                        ul: [
                            {pid: 4, h2: '170选号1'},
                            {pid: 4, h2: '170选号2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '合约机',
                        ul: [
                            {pid: 4, h2: '合约机1'},
                            {pid: 4, h2: '合约机2'}
                        ]
                    }
                ]
            }, {
                pid: 2,
                h2: '手机配件',
                ul: [
                    {
                        pid: 3,
                        h2: '手机壳',
                        ul: [
                            {pid: 4, h2: '手机壳1'},
                            {pid: 4, h2: '手机壳2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '贴膜',
                        ul: [
                            {pid: 4, h2: '贴膜1'},
                            {pid: 4, h2: '贴膜2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '手机存储卡',
                        ul: [
                            {pid: 4, h2: '手机存储卡1'},
                            {pid: 4, h2: '手机存储卡2'}
                        ]
                    }
                ]
            }
        ]
    }, {
        pid: 1,
        h2: '电脑办公',
        ul: [
            {
                pid: 2,
                h2: '电脑整机',
                ul: [
                    {
                        pid: 3,
                        h2: '抢大额神券',
                        ul: [
                            {pid: 4, h2: '抢大额神券1'},
                            {pid: 4, h2: '抢大额神券2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '笔记本',
                        ul: [
                            {pid: 4, h2: '笔记本1'},
                            {pid: 4, h2: '笔记本2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '游戏本',
                        ul: [
                            {pid: 4, h2: '游戏本1'},
                            {pid: 4, h2: '游戏本2'}
                        ]
                    }
                ]
            }, {
                pid: 2,
                h2: '电脑配件',
                ul: [
                    {
                        pid: 3,
                        h2: '低至1折',
                        ul: [
                            {pid: 4, h2: '低至1折1'},
                            {pid: 4, h2: '低至1折2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '显示器',
                        ul: [
                            {pid: 4, h2: '显示器1'},
                            {pid: 4, h2: '显示器2'}
                        ]
                    }, {
                        pid: 3,
                        h2: 'CPU',
                        ul: [
                            {pid: 4, h2: 'CPU1'},
                            {pid: 4, h2: 'CPU2'}
                        ]
                    }
                ]
            }, {
                pid: 2,
                h2: '外设产品',
                ul: [
                    {
                        pid: 3,
                        h2: '低至9.9元',
                        ul: [
                            {pid: 4, h2: '低至9.9元1'},
                            {pid: 4, h2: '低至9.9元2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '鼠标',
                        ul: [
                            {pid: 4, h2: '鼠标1'},
                            {pid: 4, h2: '鼠标2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '键盘',
                        ul: [
                            {pid: 4, h2: '键盘1'},
                            {pid: 4, h2: '键盘2'}
                        ]
                    }
                ]
            }
        ]
    }
    , {
        pid: 1,
        h2: '男装/女装',
        ul: [
            {
                pid: 2,
                h2: '女装',
                ul: [
                    {
                        pid: 3,
                        h2: '女装买3免一',
                        ul: [
                            {pid: 4, h2: '女装买3免一1'},
                            {pid: 4, h2: '女装买3免一2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '毛呢大衣',
                        ul: [
                            {pid: 4, h2: '毛呢大衣1'},
                            {pid: 4, h2: '毛呢大衣2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '羽绒服',
                        ul: [
                            {pid: 4, h2: '羽绒服1'},
                            {pid: 4, h2: '羽绒服2'}
                        ]
                    }
                ]
            }, {
                pid: 2,
                h2: '男装',
                ul: [
                    {
                        pid: 3,
                        h2: '男装买3免一',
                        ul: [
                            {pid: 4, h2: '男装买3免一1'},
                            {pid: 4, h2: '男装买3免一2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '羽绒服',
                        ul: [
                            {pid: 4, h2: '羽绒服1'},
                            {pid: 4, h2: '羽绒服2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '棉服',
                        ul: [
                            {pid: 4, h2: '棉服1'},
                            {pid: 4, h2: '棉服2'}
                        ]
                    }
                ]
            }, {
                pid: 2,
                h2: '配饰',
                ul: [
                    {
                        pid: 3,
                        h2: '女士围巾',
                        ul: [
                            {pid: 4, h2: '女士围巾1'},
                            {pid: 4, h2: '女士围巾2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '男士围巾',
                        ul: [
                            {pid: 4, h2: '男士围巾1'},
                            {pid: 4, h2: '男士围巾2'}
                        ]
                    }, {
                        pid: 3,
                        h2: '太阳镜',
                        ul: [
                            {pid: 4, h2: '太阳镜1'},
                            {pid: 4, h2: '太阳镜2'}
                        ]
                    }
                ]
            }
        ]
    }
];